{
  "selectedTemplate": 2,
  "headings": {
    "skills": "Skills",
    "projects": "Projects",
    "education": "Education",
    "work": "Experience"
  },
  "basics": {
    "name": "Andrew VanNess",
    "email": "andrewvanness221@gmail.com",
    "phone": "(508) 821-8428",
    "website": "https://oftheheadland.com"
  },
  "education": [
    {
      "institution": "Bridgewater State University",
      "studyType": "B.S.",
      "location": "Bridgewater, MA",
      "area": "Computer Science",
      "endDate": "May 2018",
      "startDate": "Aug 2014"
    }
  ],
  "work": [
    {
      "highlights": [
        "Oversaw the migration of a WordPress site to Next.js and GraphQL, resulting in a remarkable 75% improvement in page loading speed, enhanced SEO scores, and better web accessibility.",
        "Directed a team of three developers in the development and management of mission-critical marketing websites for a prominent corporation, maintaining an exceptional 99.9% uptime record through meticulous oversight and proactive troubleshooting.",
        "Demonstrated adept leadership skills by mentoring team members, fostering a collaborative environment that encouraged innovation, skill development, and excellence in web development initiatives, while consistently delivering high-quality results.",
        "Orchestrated the recruitment and hiring process, conducting interviews and assessments to onboard global talent, ensuring the team remained equipped with the requisite skills and expertise to excel in their roles.",
        "Cultivated strong communication channels with managers and stakeholders, providing regular updates on project progress, milestones, monthly newsletters, and strategic direction - building transparency and alignment across the department."
      ],
      "company": "Nexthink",
      "position": "Manager, Marketing Web Development",
      "location": "Remote",
      "startDate": "October 2021",
      "endDate": "Present"
    },
    {
      "location": "Lexington, MA",
      "position": "Web Developer",
      "website": "",
      "startDate": "May 2018",
      "highlights": [
        "Screened applications, interviewed, and assisted with selecting junior developers to be hired as part of our development team ",
        "Trained junior developers in our processes and technologies and supported them as needed through their first few months",
        "Created an internal browser extension for the CDC to automate the process of reporting fraudulent COVID-19 preventative products on online marketplaces including Amazon and eBay",
        "Rebuilt the home page of a government waste management website to reduce page load times by 80% and improved SEO to increase site traffic from 1,000 monthly users to consistently over 20,000",
        "Achieved 100% test coverage and full WCAG accessibility compliance on a flagship EPA React application"
      ],
      "company": "Eastern Research Group",
      "endDate": "October 2021"
    },
    {
      "highlights": [
        "Assigned and graded Python assignments and exams",
        "Tutored students individually and held weekly sessions with the entire class to review course material"
      ],
      "company": "Bridgewater State University",
      "position": "Computer Science Teaching Assistant",
      "startDate": "Aug 2017",
      "endDate": "May 2018",
      "location": "Bridgewater, MA"
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "level": "",
      "keywords": [
        " Next.js, React, Tailwind, TypeScript, GraphQL, Vue. WordPress, PHP, Node"
      ]
    },
    {
      "keywords": [
        "Git, Vercel, Pantheon, Invision, Figma, Asana, Jira, Algolia, Digital Ocean"
      ],
      "name": "Tools"
    }
  ],
  "projects": [
    {
      "description": "A map-centric, open source, progressive web application that pulls data from the EPA's national water quality databases to provide a user with a detailed analysis of their local water quality.",
      "url": "https://mywaterway.epa.gov/",
      "keywords": [
        "React",
        "Node",
        "Esri",
        null
      ],
      "name": "How's My Waterway"
    },
    {
      "keywords": [
        "Chrome Extension",
        ""
      ],
      "name": "Colorblindly",
      "description": "Chrome extension for simulating colorblindness on any web page for accessibility testing. 400 Github stars and over 90,000 users. Featured on the front page of Vice's tech news.",
      "url": "https://github.com/oftheheadland/Colorblindly"
    },
    {
      "keywords": [
        "React, Node, MongoDB",
        null
      ],
      "description": "Discord bot for seamlessly searching and sharing images, videos, news, and more. In use by over 125,000 members across 1,000 communities.",
      "url": "https://jamiebot.com/",
      "name": "Jamie Bot"
    }
  ],
  "awards": [
    {}
  ],
  "sections": [
    "templates",
    "profile",
    "work",
    "projects",
    "education",
    "skills",
    "awards"
  ]
}